run/papers/consistentFSI/cirleInCircle/fsiBody3Mesh4_RK4-2/base/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh dynamicMotionSolverFvMesh;

solver RBFMotionSolverExt;

movingPatches ( inside );
staticPatches ( outside );
coarseningRatioStat 1;
coarseningRatioMov 1;

interpolation
{
    RBF  TPS;
    Dim TwoD;
    polyNomials true;
    radius 1;

    TPSCoeffs
    {
        radius     1.0;
    }
}
// ************************************************************************* //
