run/papers/consistentFSI/cirleInCircle/fsiBody3Mesh4_RK4-2/base/system/writeSetsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      writeSetsDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//Fields to be written out
fields ( U p );

//All above fields are written out for these cellSets
cellSets ( convergenceSet );

//All above fields are written out for these faceSets
faceSets ();

//All above fields are written out for these patches
patches ();


// ************************************************************************* //
